{
  "config": {
    "mode": "hybrid",
    "precision": {
      "X": 0.001,
      "Y": 0.001,
      "Z": 0.001,
      "A": 0.001,
      "B": 0.001,
      "C": 0.001,
      "I": 0.0001,
      "J": 0.0001,
      "K": 0.0001,
      "F": 1.0,
      "S": 10.0,
      "R": 0.0001,
      "P": 0.001,
      "Q": 0.001,
      "E": 0.0001
    },
    "clip_bins": {},
    "canonical_decimal_places": 4,
    "ignore_for_pid": [
      "F",
      "S"
    ],
    "special": {
      "PAD": 0,
      "BOS": 1,
      "EOS": 2,
      "UNK": 3,
      "MASK": 4
    },
    "vocab_size": 50000,
    "min_freq": 1,
    "dynamic_numbers": false,
    "bucket_digits": 2
  },
  "vocab": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "UNK": 3,
    "MASK": 4,
    "X": 5,
    "Y": 6,
    "Z": 7,
    "NUM_Y_16": 8,
    "NUM_X_14": 9,
    "NUM_Y_15": 10,
    "NUM_X_15": 11,
    "NUM_X_16": 12,
    "NUM_Y_14": 13,
    "NUM_Z_-1": 14,
    "R": 15,
    "NUM_Z_-8": 16,
    "NUM_Z_-2": 17,
    "NUM_Z_-3": 18,
    "NUM_Z_-4": 19,
    "NUM_Z_-5": 20,
    "NUM_Z_-6": 21,
    "NUM_Z_-9": 22,
    "NUM_Z_-7": 23,
    "G0": 24,
    "NUM_R_37": 25,
    "NUM_Z_60": 26,
    "NUM_X_19": 27,
    "NUM_Y_12": 28,
    "NUM_Z_10": 29,
    "NUM_Z_20": 30,
    "NUM_R_15": 31,
    "NUM_R_22": 32,
    "NUM_R_30": 33,
    "NUM_R_75": 34,
    "NUM_Z_11": 35,
    "NUM_Z_12": 36,
    "NUM_R_83": 37,
    "NUM_Z_99": 38,
    "G3": 39,
    "NUM_Z_89": 40,
    "NUM_Z_50": 41,
    "NUM_Z_80": 42,
    "NUM_Z_90": 43,
    "G1": 44,
    "NUM_Z_81": 45,
    "NUM_Z_88": 46,
    "NUM_Z_96": 47,
    "NUM_Z_02": 48,
    "NUM_Z_78": 49,
    "NUM_Z_79": 50,
    "NUM_Z_98": 51,
    "Z0.": 52,
    "F": 53,
    "G53": 54,
    "M30": 55,
    "NUM_F_07": 56,
    "NUM_Y_18": 57,
    "NUM_Y_19": 58,
    "NUM_Z_00": 59,
    "NUM_Z_07": 60,
    "NUM_Z_14": 61,
    "NUM_Z_25": 62,
    "NUM_Z_76": 63,
    "NUM_Z_77": 64,
    "NUM_Z_86": 65,
    "NUM_Z_97": 66,
    "F22.": 67,
    "NUM_X_12": 68,
    "NUM_X_13": 69,
    "NUM_X_18": 70,
    "NUM_Z_04": 71,
    "NUM_Z_05": 72,
    "NUM_Z_06": 73,
    "NUM_Z_08": 74,
    "NUM_Z_09": 75,
    "NUM_Z_17": 76,
    "NUM_Z_18": 77,
    "NUM_Z_19": 78,
    "NUM_Z_21": 79,
    "NUM_Z_22": 80,
    "NUM_Z_23": 81,
    "NUM_Z_24": 82,
    "NUM_Z_27": 83,
    "NUM_Z_28": 84,
    "NUM_Z_29": 85,
    "NUM_Z_30": 86,
    "NUM_Z_31": 87,
    "NUM_Z_32": 88,
    "NUM_Z_33": 89,
    "NUM_Z_34": 90,
    "NUM_Z_35": 91,
    "NUM_Z_38": 92,
    "NUM_Z_39": 93,
    "NUM_Z_40": 94,
    "NUM_Z_41": 95,
    "NUM_Z_42": 96,
    "NUM_Z_43": 97,
    "NUM_Z_44": 98,
    "NUM_Z_45": 99,
    "NUM_Z_46": 100,
    "NUM_Z_47": 101,
    "NUM_Z_48": 102,
    "NUM_Z_52": 103,
    "NUM_Z_53": 104,
    "NUM_Z_54": 105,
    "NUM_Z_55": 106,
    "NUM_Z_56": 107,
    "NUM_Z_57": 108,
    "NUM_Z_58": 109,
    "NUM_Z_59": 110,
    "NUM_Z_62": 111,
    "NUM_Z_63": 112,
    "NUM_Z_64": 113,
    "NUM_Z_65": 114,
    "NUM_Z_66": 115,
    "NUM_Z_67": 116,
    "NUM_Z_68": 117,
    "NUM_Z_69": 118,
    "NUM_Z_70": 119,
    "NUM_Z_71": 120,
    "NUM_Z_72": 121,
    "NUM_Z_74": 122,
    "NUM_Z_75": 123,
    "NUM_Z_82": 124,
    "NUM_Z_83": 125,
    "NUM_Z_85": 126,
    "NUM_Z_87": 127,
    "NUM_Z_91": 128,
    "NUM_Z_92": 129,
    "NUM_Z_93": 130,
    "NUM_Z_13": 131,
    "NUM_Z_95": 132,
    "NUM_Z_01": 133,
    "NUM_Z_36": 134,
    "NUM_Z_51": 135,
    "NUM_Z_16": 136,
    "NUM_X_-1": 137,
    "NUM_X_32": 138,
    "NUM_X_33": 139,
    "G2": 140,
    "NUM_X_-2": 141,
    "NUM_Z_15": 142,
    "NUM_Y_17": 143,
    "NUM_Y_20": 144,
    "NUM_Y_22": 145,
    "NUM_Y_26": 146,
    "NUM_Y_29": 147,
    "NUM_Z_37": 148,
    "NUM_Y_10": 149,
    "NUM_Y_11": 150,
    "NUM_Y_13": 151,
    "NUM_Y_21": 152,
    "NUM_Y_23": 153,
    "NUM_Y_24": 154,
    "NUM_Y_25": 155,
    "NUM_Y_27": 156,
    "NUM_Y_28": 157,
    "NUM_Y_30": 158,
    "NUM_Y_37": 159,
    "NUM_Y_43": 160,
    "NUM_Y_45": 161,
    "NUM_Y_54": 162,
    "NUM_Y_62": 163,
    "NUM_Y_70": 164,
    "NUM_Y_78": 165,
    "NUM_Y_87": 166,
    "NUM_Y_95": 167,
    "NUM_Z_73": 168,
    "NUM_Z_94": 169
  }
}