{
  "config": {
    "mode": "hybrid",
    "precision": {
      "X": 0.001,
      "Y": 0.001,
      "Z": 0.001,
      "A": 0.001,
      "B": 0.001,
      "C": 0.001,
      "I": 0.0001,
      "J": 0.0001,
      "K": 0.0001,
      "F": 1.0,
      "S": 10.0,
      "R": 0.0001,
      "P": 0.001,
      "Q": 0.001,
      "E": 0.0001
    },
    "clip_bins": {},
    "canonical_decimal_places": 4,
    "ignore_for_pid": [
      "F",
      "S"
    ],
    "special": {
      "PAD": 0,
      "BOS": 1,
      "EOS": 2,
      "UNK": 3,
      "MASK": 4
    },
    "vocab_size": 5000,
    "min_freq": 1,
    "dynamic_numbers": false,
    "bucket_digits": 2
  },
  "vocab": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "UNK": 3,
    "MASK": 4,
    "X": 5,
    "G1": 6,
    "Y": 7,
    "NUM_X_-1": 8,
    "Z": 9,
    "NUM_X_35": 10,
    "NUM_X_32": 11,
    "R": 12,
    "NUM_Y_16": 13,
    "NUM_X_14": 14,
    "NUM_X_16": 15,
    "NUM_Y_15": 16,
    "NUM_X_15": 17,
    "NUM_Y_14": 18,
    "G0": 19,
    "M30": 20,
    "NUM_Z_-1": 21,
    "Z0.": 22,
    "NUM_R_74": 23,
    "G53": 24,
    "NUM_X_33": 25,
    "NUM_R_83": 26,
    "NUM_X_12": 27,
    "NUM_Y_18": 28,
    "G3": 29,
    "NUM_X_17": 30,
    "G2": 31,
    "NUM_Y_12": 32,
    "NUM_Y_23": 33,
    "NUM_Y_17": 34,
    "NUM_Y_27": 35,
    "NUM_R_11": 36,
    "NUM_X_18": 37,
    "NUM_Y_25": 38,
    "NUM_X_30": 39,
    "NUM_X_25": 40,
    "NUM_X_10": 41,
    "NUM_Y_33": 42,
    "NUM_X_31": 43,
    "NUM_Y_30": 44,
    "NUM_X_-2": 45,
    "NUM_X_23": 46,
    "NUM_Z_60": 47,
    "NUM_Y_29": 48,
    "NUM_X_19": 49,
    "NUM_Y_31": 50,
    "NUM_Y_34": 51,
    "NUM_X_13": 52,
    "NUM_X_34": 53,
    "NUM_X_28": 54,
    "NUM_Y_28": 55,
    "NUM_X_26": 56,
    "NUM_X_27": 57,
    "NUM_Y_32": 58,
    "Y0.": 59,
    "NUM_Y_86": 60,
    "NUM_Y_24": 61,
    "NUM_R_37": 62,
    "NUM_Y_20": 63,
    "NUM_X_24": 64,
    "NUM_Y_19": 65,
    "NUM_Y_26": 66,
    "NUM_Y_21": 67,
    "NUM_Y_13": 68,
    "NUM_Y_11": 69,
    "NUM_Y_37": 70,
    "NUM_Z_-8": 71,
    "NUM_Z_-2": 72,
    "NUM_Z_-4": 73,
    "NUM_Z_-6": 74,
    "NUM_Z_-5": 75,
    "NUM_Y_52": 76,
    "NUM_Z_-9": 77,
    "NUM_Z_-3": 78,
    "NUM_X_11": 79,
    "NUM_Z_-7": 80,
    "NUM_Y_10": 81,
    "NUM_Y_22": 82,
    "NUM_X_21": 83,
    "NUM_X_83": 84,
    "F": 85,
    "NUM_Y_96": 86,
    "NUM_X_20": 87,
    "NUM_Y_67": 88,
    "X0.": 89,
    "NUM_X_67": 90,
    "NUM_X_29": 91,
    "NUM_Z_25": 92,
    "NUM_Y_81": 93,
    "NUM_X_81": 94,
    "NUM_Z_20": 95,
    "NUM_X_22": 96,
    "NUM_X_36": 97,
    "NUM_Y_77": 98,
    "NUM_Z_59": 99,
    "NUM_X_96": 100,
    "NUM_X_59": 101,
    "NUM_X_86": 102,
    "NUM_Y_64": 103,
    "NUM_Y_61": 104,
    "NUM_Y_44": 105,
    "NUM_R_30": 106,
    "NUM_F_13": 107,
    "NUM_Y_-1": 108,
    "NUM_Y_60": 109,
    "NUM_X_74": 110,
    "NUM_Y_70": 111,
    "NUM_X_43": 112,
    "NUM_R_22": 113,
    "NUM_Z_72": 114,
    "NUM_Z_74": 115,
    "NUM_Y_-2": 116,
    "NUM_R_12": 117,
    "NUM_F_07": 118,
    "NUM_Z_10": 119,
    "NUM_X_90": 120,
    "NUM_Y_91": 121,
    "NUM_X_92": 122,
    "NUM_Y_62": 123,
    "NUM_Y_92": 124,
    "NUM_Y_47": 125,
    "NUM_Z_39": 126,
    "NUM_X_37": 127,
    "NUM_Y_90": 128,
    "NUM_X_62": 129,
    "NUM_X_77": 130,
    "NUM_Z_19": 131,
    "NUM_R_15": 132,
    "NUM_X_47": 133,
    "NUM_Y_54": 134,
    "NUM_R_71": 135,
    "NUM_Z_21": 136,
    "NUM_Y_43": 137,
    "NUM_R_54": 138,
    "NUM_Z_12": 139,
    "NUM_X_52": 140,
    "NUM_Z_01": 141,
    "NUM_Z_50": 142,
    "NUM_X_65": 143,
    "NUM_Z_07": 144,
    "NUM_Z_80": 145,
    "NUM_Y_74": 146,
    "NUM_Y_78": 147,
    "NUM_Y_-7": 148,
    "NUM_Z_05": 149,
    "NUM_Z_11": 150,
    "NUM_Z_14": 151,
    "NUM_Z_00": 152,
    "NUM_X_94": 153,
    "NUM_X_63": 154,
    "NUM_Z_03": 155,
    "NUM_Z_17": 156,
    "NUM_Z_99": 157,
    "NUM_Y_99": 158,
    "NUM_Z_89": 159,
    "NUM_Z_96": 160,
    "NUM_Z_98": 161,
    "NUM_R_18": 162,
    "NUM_Z_70": 163,
    "NUM_Z_87": 164,
    "NUM_Z_90": 165,
    "NUM_Y_73": 166,
    "NUM_Z_16": 167,
    "NUM_Z_77": 168,
    "NUM_Z_78": 169,
    "NUM_Z_97": 170,
    "NUM_R_20": 171,
    "NUM_Z_86": 172,
    "NUM_Z_88": 173,
    "NUM_X_73": 174,
    "NUM_Z_38": 175,
    "NUM_Z_48": 176,
    "NUM_Z_76": 177,
    "NUM_R_19": 178,
    "NUM_Z_18": 179,
    "NUM_Z_95": 180,
    "NUM_R_75": 181,
    "NUM_Y_45": 182,
    "NUM_Z_02": 183,
    "NUM_Z_85": 184,
    "NUM_Z_06": 185,
    "NUM_Z_82": 186,
    "NUM_Z_83": 187,
    "NUM_Y_63": 188,
    "NUM_Z_04": 189,
    "NUM_Z_09": 190,
    "NUM_Z_22": 191,
    "NUM_Z_23": 192,
    "NUM_Z_24": 193,
    "NUM_Z_29": 194,
    "NUM_Z_30": 195,
    "NUM_Z_31": 196,
    "NUM_Z_32": 197,
    "NUM_Z_33": 198,
    "NUM_Z_34": 199,
    "NUM_Z_35": 200,
    "NUM_Z_40": 201,
    "NUM_Z_41": 202,
    "NUM_Z_42": 203,
    "NUM_Z_43": 204,
    "NUM_Z_44": 205,
    "NUM_Z_45": 206,
    "NUM_Z_46": 207,
    "NUM_Z_52": 208,
    "NUM_Z_53": 209,
    "NUM_Z_54": 210,
    "NUM_Z_55": 211,
    "NUM_Z_56": 212,
    "NUM_Z_57": 213,
    "NUM_Z_62": 214,
    "NUM_Z_63": 215,
    "NUM_Z_64": 216,
    "NUM_Z_65": 217,
    "NUM_Z_66": 218,
    "NUM_Z_67": 219,
    "NUM_Z_68": 220,
    "NUM_Z_75": 221,
    "NUM_Z_93": 222,
    "NUM_R_79": 223,
    "NUM_X_70": 224,
    "NUM_Y_49": 225,
    "NUM_Y_56": 226,
    "NUM_Z_13": 227,
    "F40.": 228,
    "NUM_R_16": 229,
    "NUM_Y_51": 230,
    "NUM_Z_91": 231,
    "NUM_R_63": 232,
    "NUM_X_80": 233,
    "NUM_Z_47": 234,
    "NUM_Y_36": 235,
    "NUM_Z_36": 236,
    "NUM_Z_51": 237,
    "NUM_Y_39": 238,
    "NUM_Z_08": 239,
    "NUM_Z_28": 240,
    "NUM_Y_69": 241,
    "NUM_Y_95": 242,
    "NUM_Z_58": 243,
    "NUM_Z_69": 244,
    "NUM_X_78": 245,
    "NUM_X_93": 246,
    "NUM_X_48": 247,
    "NUM_R_25": 248,
    "F22.": 249,
    "NUM_Y_93": 250,
    "NUM_Z_81": 251,
    "NUM_Z_27": 252,
    "NUM_Y_97": 253,
    "NUM_R_67": 254,
    "NUM_X_87": 255,
    "NUM_Y_38": 256,
    "NUM_Y_59": 257,
    "NUM_Z_79": 258,
    "NUM_Y_01": 259,
    "NUM_Y_65": 260,
    "NUM_Y_84": 261,
    "NUM_Z_92": 262,
    "NUM_Y_48": 263,
    "NUM_Z_84": 264,
    "NUM_X_45": 265,
    "NUM_Y_79": 266,
    "NUM_Y_87": 267,
    "NUM_Z_26": 268,
    "NUM_Z_71": 269,
    "NUM_Z_73": 270,
    "NUM_Z_94": 271,
    "NUM_Z_61": 272,
    "NUM_X_38": 273,
    "NUM_X_41": 274,
    "NUM_Y_76": 275,
    "NUM_Y_89": 276,
    "NUM_X_-7": 277,
    "NUM_X_88": 278,
    "NUM_Y_42": 279,
    "NUM_Y_94": 280,
    "NUM_X_99": 281,
    "NUM_Y_35": 282,
    "NUM_X_85": 283,
    "NUM_X_79": 284,
    "NUM_X_95": 285,
    "NUM_X_51": 286,
    "NUM_X_56": 287,
    "NUM_Y_41": 288,
    "NUM_Y_68": 289,
    "NUM_Z_15": 290,
    "NUM_X_49": 291,
    "NUM_Y_-5": 292,
    "NUM_Y_75": 293,
    "NUM_Y_80": 294,
    "NUM_Y_83": 295,
    "NUM_X_55": 296,
    "NUM_X_84": 297,
    "NUM_X_97": 298,
    "NUM_X_98": 299,
    "NUM_X_50": 300,
    "NUM_X_68": 301,
    "NUM_X_69": 302,
    "NUM_X_91": 303,
    "NUM_Y_71": 304,
    "NUM_Y_82": 305,
    "NUM_Y_85": 306,
    "NUM_X_60": 307,
    "NUM_X_64": 308,
    "NUM_X_66": 309,
    "NUM_X_82": 310,
    "NUM_Y_98": 311,
    "NUM_X_54": 312,
    "NUM_X_53": 313,
    "NUM_X_75": 314,
    "NUM_Y_57": 315,
    "NUM_Y_58": 316,
    "NUM_Z_37": 317,
    "NUM_X_89": 318,
    "NUM_Y_50": 319,
    "NUM_Y_88": 320,
    "G55": 321,
    "NUM_X_06": 322,
    "NUM_X_57": 323,
    "NUM_X_71": 324,
    "NUM_Y_-8": 325,
    "NUM_Y_72": 326,
    "T2": 327,
    "G17": 328,
    "G90": 329,
    "G94": 330,
    "M3": 331,
    "NUM_S_12": 332,
    "NUM_X_58": 333,
    "S": 334
  }
}