{
  "config": {
    "mode": "hybrid",
    "precision": {
      "X": 0.001,
      "Y": 0.001,
      "Z": 0.001,
      "A": 0.001,
      "B": 0.001,
      "C": 0.001,
      "I": 0.0001,
      "J": 0.0001,
      "K": 0.0001,
      "F": 1.0,
      "S": 10.0,
      "R": 0.0001,
      "P": 0.001,
      "Q": 0.001,
      "E": 0.0001
    },
    "clip_bins": {},
    "canonical_decimal_places": 4,
    "ignore_for_pid": [
      "F",
      "S"
    ],
    "special": {
      "PAD": 0,
      "BOS": 1,
      "EOS": 2,
      "UNK": 3,
      "MASK": 4
    },
    "vocab_size": 10000,
    "min_freq": 1,
    "dynamic_numbers": false,
    "bucket_digits": 4
  },
  "vocab": {
    "PAD": 0,
    "BOS": 1,
    "EOS": 2,
    "UNK": 3,
    "MASK": 4,
    "X": 5,
    "Y": 6,
    "Z": 7,
    "R": 8,
    "NUM_Y_1575": 9,
    "NUM_X_1650": 10,
    "NUM_X_1575": 11,
    "NUM_X_1412": 12,
    "NUM_Y_1693": 13,
    "NUM_Y_1457": 14,
    "NUM_X_1413": 15,
    "G0": 16,
    "NUM_X_1645": 17,
    "NUM_R_3750": 18,
    "NUM_Y_1456": 19,
    "NUM_Y_1458": 20,
    "NUM_Y_1462": 21,
    "NUM_X_1414": 22,
    "NUM_Y_1694": 23,
    "NUM_X_1647": 24,
    "NUM_X_1649": 25,
    "NUM_Y_1690": 26,
    "NUM_X_1444": 27,
    "NUM_Y_1460": 28,
    "NUM_X_1453": 29,
    "NUM_X_1648": 30,
    "NUM_X_1416": 31,
    "NUM_Y_1692": 32,
    "NUM_X_1417": 33,
    "NUM_X_1500": 34,
    "NUM_X_1592": 35,
    "NUM_X_1586": 36,
    "NUM_X_1631": 37,
    "NUM_Y_1470": 38,
    "NUM_X_1634": 39,
    "NUM_X_1581": 40,
    "NUM_X_1463": 41,
    "NUM_X_1641": 42,
    "NUM_X_1436": 43,
    "NUM_X_1458": 44,
    "NUM_Y_1490": 45,
    "NUM_Y_1688": 46,
    "NUM_X_1440": 47,
    "NUM_X_1643": 48,
    "NUM_Y_1678": 49,
    "NUM_X_1422": 50,
    "NUM_Y_1464": 51,
    "NUM_X_1419": 52,
    "NUM_X_1424": 53,
    "NUM_X_1619": 54,
    "NUM_X_1627": 55,
    "NUM_Y_1459": 56,
    "NUM_Y_1517": 57,
    "NUM_Z_0600": 58,
    "NUM_X_1415": 59,
    "NUM_X_1548": 60,
    "NUM_X_1623": 61,
    "NUM_Y_1664": 62,
    "NUM_R_0750": 63,
    "NUM_R_1500": 64,
    "NUM_R_2250": 65,
    "NUM_R_3000": 66,
    "NUM_X_1469": 67,
    "NUM_X_1471": 68,
    "NUM_X_1477": 69,
    "NUM_X_1482": 70,
    "NUM_X_1529": 71,
    "NUM_X_1554": 72,
    "NUM_X_1560": 73,
    "NUM_X_1615": 74,
    "NUM_X_1950": 75,
    "NUM_Y_1650": 76,
    "NUM_Y_1676": 77,
    "NUM_Y_1683": 78,
    "NUM_X_1427": 79,
    "NUM_X_1430": 80,
    "NUM_X_1449": 81,
    "NUM_X_1488": 82,
    "NUM_X_1494": 83,
    "NUM_X_1535": 84,
    "NUM_X_1563": 85,
    "NUM_Y_1608": 86,
    "NUM_Y_1656": 87,
    "NUM_Y_1661": 88,
    "NUM_X_1598": 89,
    "NUM_X_1603": 90,
    "NUM_Y_1465": 91,
    "NUM_Y_1602": 92,
    "NUM_Y_1614": 93,
    "NUM_Y_1620": 94,
    "NUM_Y_1646": 95,
    "NUM_Y_1651": 96,
    "NUM_Z_-008": 97,
    "NUM_Z_-066": 98,
    "NUM_R_0830": 99,
    "NUM_X_1569": 100,
    "NUM_X_1608": 101,
    "NUM_Y_1467": 102,
    "NUM_Y_1473": 103,
    "NUM_Y_1480": 104,
    "NUM_Y_1677": 105,
    "NUM_Y_1685": 106,
    "NUM_Z_-043": 107,
    "NUM_Z_-115": 108,
    "NUM_X_1587": 109,
    "NUM_Y_1680": 110,
    "NUM_Z_-010": 111,
    "NUM_Z_-078": 112,
    "NUM_X_1438": 113,
    "NUM_X_1640": 114,
    "NUM_Y_1516": 115,
    "NUM_X_1434": 116,
    "NUM_X_1516": 117,
    "NUM_Y_1478": 118,
    "NUM_X_1432": 119,
    "NUM_X_1513": 120,
    "NUM_Y_1689": 121,
    "NUM_Z_0099": 122,
    "G3": 123,
    "NUM_X_1501": 124,
    "NUM_X_1526": 125,
    "NUM_X_1637": 126,
    "NUM_Y_1522": 127,
    "NUM_Y_1686": 128,
    "NUM_X_1448": 129,
    "NUM_X_1507": 130,
    "NUM_Y_1510": 131,
    "NUM_Y_1542": 132,
    "NUM_Y_1691": 133,
    "NUM_Z_-020": 134,
    "NUM_Z_0089": 135,
    "NUM_Y_1672": 136,
    "NUM_X_1520": 137,
    "NUM_X_1638": 138,
    "NUM_Y_1494": 139,
    "NUM_Y_1548": 140,
    "NUM_Z_0050": 141,
    "NUM_Y_1469": 142,
    "NUM_Y_1511": 143,
    "NUM_Y_1660": 144,
    "NUM_Z_0080": 145,
    "NUM_Z_0090": 146,
    "G1": 147,
    "NUM_X_1495": 148,
    "NUM_Y_1472": 149,
    "NUM_Y_1603": 150,
    "NUM_Y_1645": 151,
    "NUM_Z_-068": 152,
    "NUM_Z_-117": 153,
    "NUM_Z_0081": 154,
    "NUM_Z_0088": 155,
    "NUM_Z_0096": 156,
    "NUM_X_1541": 157,
    "NUM_X_1542": 158,
    "NUM_X_1605": 159,
    "NUM_X_1610": 160,
    "NUM_X_1614": 161,
    "NUM_Y_1484": 162,
    "NUM_Y_1591": 163,
    "NUM_Y_1616": 164,
    "NUM_Y_1655": 165,
    "NUM_Y_1668": 166,
    "NUM_Y_1681": 167,
    "NUM_Z_-076": 168,
    "NUM_Z_0002": 169,
    "NUM_Z_0078": 170,
    "NUM_Z_0079": 171,
    "NUM_Z_0098": 172,
    "Z0.": 173,
    "F": 174,
    "G53": 175,
    "M30": 176,
    "NUM_F_0007": 177,
    "NUM_X_1425": 178,
    "NUM_X_1480": 179,
    "NUM_X_1538": 180,
    "NUM_Y_1461": 181,
    "NUM_Y_1468": 182,
    "NUM_Y_1500": 183,
    "NUM_Y_1529": 184,
    "NUM_Y_1535": 185,
    "NUM_Y_1589": 186,
    "NUM_Y_1600": 187,
    "NUM_Y_1633": 188,
    "NUM_Y_1634": 189,
    "NUM_Y_1674": 190,
    "NUM_Z_-056": 191,
    "NUM_Z_-088": 192,
    "NUM_Z_-100": 193,
    "NUM_Z_-114": 194,
    "NUM_Z_0000": 195,
    "NUM_Z_0007": 196,
    "NUM_Z_0010": 197,
    "NUM_Z_0014": 198,
    "NUM_Z_0025": 199,
    "NUM_Z_0076": 200,
    "NUM_Z_0077": 201,
    "NUM_Z_0086": 202,
    "NUM_Z_0097": 203,
    "NUM_Z_0100": 204,
    "NUM_Z_0200": 205,
    "F22.": 206,
    "NUM_X_1200": 207,
    "NUM_X_1350": 208,
    "NUM_X_1420": 209,
    "NUM_X_1429": 210,
    "NUM_X_1466": 211,
    "NUM_X_1468": 212,
    "NUM_X_1472": 213,
    "NUM_X_1474": 214,
    "NUM_X_1566": 215,
    "NUM_X_1572": 216,
    "NUM_X_1612": 217,
    "NUM_X_1613": 218,
    "NUM_X_1629": 219,
    "NUM_X_1635": 220,
    "NUM_X_1800": 221,
    "NUM_Y_1200": 222,
    "NUM_Y_1275": 223,
    "NUM_Y_1425": 224,
    "NUM_Y_1471": 225,
    "NUM_Y_1474": 226,
    "NUM_Y_1477": 227,
    "NUM_Y_1481": 228,
    "NUM_Y_1485": 229,
    "NUM_Y_1489": 230,
    "NUM_Y_1491": 231,
    "NUM_Y_1495": 232,
    "NUM_Y_1505": 233,
    "NUM_Y_1523": 234,
    "NUM_Y_1540": 235,
    "NUM_Y_1547": 236,
    "NUM_Y_1550": 237,
    "NUM_Y_1555": 238,
    "NUM_Y_1556": 239,
    "NUM_Y_1561": 240,
    "NUM_Y_1562": 241,
    "NUM_Y_1567": 242,
    "NUM_Y_1568": 243,
    "NUM_Y_1573": 244,
    "NUM_Y_1576": 245,
    "NUM_Y_1580": 246,
    "NUM_Y_1581": 247,
    "NUM_Y_1583": 248,
    "NUM_Y_1595": 249,
    "NUM_Y_1597": 250,
    "NUM_Y_1606": 251,
    "NUM_Y_1610": 252,
    "NUM_Y_1621": 253,
    "NUM_Y_1627": 254,
    "NUM_Y_1638": 255,
    "NUM_Y_1640": 256,
    "NUM_Y_1659": 257,
    "NUM_Y_1665": 258,
    "NUM_Y_1682": 259,
    "NUM_Y_1800": 260,
    "NUM_Y_1950": 261,
    "NUM_Z_-001": 262,
    "NUM_Z_-002": 263,
    "NUM_Z_-003": 264,
    "NUM_Z_-004": 265,
    "NUM_Z_-005": 266,
    "NUM_Z_-006": 267,
    "NUM_Z_-012": 268,
    "NUM_Z_-013": 269,
    "NUM_Z_-014": 270,
    "NUM_Z_-015": 271,
    "NUM_Z_-016": 272,
    "NUM_Z_-017": 273,
    "NUM_Z_-018": 274,
    "NUM_Z_-023": 275,
    "NUM_Z_-024": 276,
    "NUM_Z_-025": 277,
    "NUM_Z_-026": 278,
    "NUM_Z_-027": 279,
    "NUM_Z_-028": 280,
    "NUM_Z_-029": 281,
    "NUM_Z_-030": 282,
    "NUM_Z_-033": 283,
    "NUM_Z_-034": 284,
    "NUM_Z_-035": 285,
    "NUM_Z_-036": 286,
    "NUM_Z_-037": 287,
    "NUM_Z_-038": 288,
    "NUM_Z_-039": 289,
    "NUM_Z_-040": 290,
    "NUM_Z_-041": 291,
    "NUM_Z_-046": 292,
    "NUM_Z_-047": 293,
    "NUM_Z_-048": 294,
    "NUM_Z_-049": 295,
    "NUM_Z_-050": 296,
    "NUM_Z_-051": 297,
    "NUM_Z_-052": 298,
    "NUM_Z_-053": 299,
    "NUM_Z_-058": 300,
    "NUM_Z_-059": 301,
    "NUM_Z_-060": 302,
    "NUM_Z_-061": 303,
    "NUM_Z_-062": 304,
    "NUM_Z_-063": 305,
    "NUM_Z_-064": 306,
    "NUM_Z_-070": 307,
    "NUM_Z_-071": 308,
    "NUM_Z_-072": 309,
    "NUM_Z_-073": 310,
    "NUM_Z_-074": 311,
    "NUM_Z_-081": 312,
    "NUM_Z_-082": 313,
    "NUM_Z_-083": 314,
    "NUM_Z_-084": 315,
    "NUM_Z_-085": 316,
    "NUM_Z_-086": 317,
    "NUM_Z_-091": 318,
    "NUM_Z_-092": 319,
    "NUM_Z_-093": 320,
    "NUM_Z_-094": 321,
    "NUM_Z_-095": 322,
    "NUM_Z_-096": 323,
    "NUM_Z_-097": 324,
    "NUM_Z_-098": 325,
    "NUM_Z_-103": 326,
    "NUM_Z_-104": 327,
    "NUM_Z_-105": 328,
    "NUM_Z_-106": 329,
    "NUM_Z_-107": 330,
    "NUM_Z_-108": 331,
    "NUM_Z_-109": 332,
    "NUM_Z_-110": 333,
    "NUM_Z_-111": 334,
    "NUM_Z_-116": 335,
    "NUM_Z_-118": 336,
    "NUM_Z_-119": 337,
    "NUM_Z_-120": 338,
    "NUM_Z_-123": 339,
    "NUM_Z_-124": 340,
    "NUM_Z_0004": 341,
    "NUM_Z_0005": 342,
    "NUM_Z_0006": 343,
    "NUM_Z_0008": 344,
    "NUM_Z_0009": 345,
    "NUM_Z_0011": 346,
    "NUM_Z_0012": 347,
    "NUM_Z_0017": 348,
    "NUM_Z_0018": 349,
    "NUM_Z_0019": 350,
    "NUM_Z_0020": 351,
    "NUM_Z_0021": 352,
    "NUM_Z_0022": 353,
    "NUM_Z_0023": 354,
    "NUM_Z_0024": 355,
    "NUM_Z_0027": 356,
    "NUM_Z_0028": 357,
    "NUM_Z_0029": 358,
    "NUM_Z_0030": 359,
    "NUM_Z_0031": 360,
    "NUM_Z_0032": 361,
    "NUM_Z_0033": 362,
    "NUM_Z_0034": 363,
    "NUM_Z_0035": 364,
    "NUM_Z_0038": 365,
    "NUM_Z_0039": 366,
    "NUM_Z_0040": 367,
    "NUM_Z_0041": 368,
    "NUM_Z_0042": 369,
    "NUM_Z_0043": 370,
    "NUM_Z_0044": 371,
    "NUM_Z_0045": 372,
    "NUM_Z_0046": 373,
    "NUM_Z_0047": 374,
    "NUM_Z_0048": 375,
    "NUM_Z_0052": 376,
    "NUM_Z_0053": 377,
    "NUM_Z_0054": 378,
    "NUM_Z_0055": 379,
    "NUM_Z_0056": 380,
    "NUM_Z_0057": 381,
    "NUM_Z_0058": 382,
    "NUM_Z_0059": 383,
    "NUM_Z_0060": 384,
    "NUM_Z_0062": 385,
    "NUM_Z_0063": 386,
    "NUM_Z_0064": 387,
    "NUM_Z_0065": 388,
    "NUM_Z_0066": 389,
    "NUM_Z_0067": 390,
    "NUM_Z_0068": 391,
    "NUM_Z_0069": 392,
    "NUM_Z_0070": 393,
    "NUM_Z_0071": 394,
    "NUM_Z_0072": 395,
    "NUM_Z_0074": 396,
    "NUM_Z_0075": 397,
    "NUM_Z_0082": 398,
    "NUM_Z_0083": 399,
    "NUM_Z_0085": 400,
    "NUM_Z_0087": 401,
    "NUM_Z_0091": 402,
    "NUM_Z_0092": 403,
    "NUM_Z_0093": 404,
    "NUM_Z_0111": 405,
    "NUM_Z_0125": 406,
    "NUM_X_1418": 407,
    "NUM_X_1423": 408,
    "NUM_X_1426": 409,
    "NUM_X_1446": 410,
    "NUM_X_1461": 411,
    "NUM_X_1485": 412,
    "NUM_X_1506": 413,
    "NUM_X_1519": 414,
    "NUM_X_1523": 415,
    "NUM_X_1553": 416,
    "NUM_X_1557": 417,
    "NUM_X_1617": 418,
    "NUM_X_1621": 419,
    "NUM_X_1636": 420,
    "NUM_Y_1493": 421,
    "NUM_Y_1502": 422,
    "NUM_Y_1507": 423,
    "NUM_Y_1512": 424,
    "NUM_Y_1521": 425,
    "NUM_Y_1527": 426,
    "NUM_Y_1538": 427,
    "NUM_Y_1544": 428,
    "NUM_Y_1586": 429,
    "NUM_Y_1626": 430,
    "NUM_Y_1641": 431,
    "NUM_Y_1642": 432,
    "NUM_Y_1669": 433,
    "NUM_Y_1670": 434,
    "NUM_Y_1671": 435,
    "NUM_Z_-022": 436,
    "NUM_Z_-031": 437,
    "NUM_Z_-045": 438,
    "NUM_Z_-057": 439,
    "NUM_Z_-080": 440,
    "NUM_Z_-087": 441,
    "NUM_Z_-099": 442,
    "NUM_Z_0013": 443,
    "NUM_Z_0095": 444,
    "NUM_X_1512": 445,
    "NUM_X_1532": 446,
    "NUM_X_1551": 447,
    "NUM_X_1632": 448,
    "NUM_X_1644": 449,
    "NUM_Y_1498": 450,
    "NUM_Y_1532": 451,
    "NUM_Y_1582": 452,
    "NUM_Y_1593": 453,
    "NUM_Y_1624": 454,
    "NUM_Y_1630": 455,
    "NUM_Y_1632": 456,
    "NUM_Y_1635": 457,
    "NUM_Y_1637": 458,
    "NUM_Y_1673": 459,
    "NUM_Z_-075": 460,
    "NUM_Z_-101": 461,
    "NUM_Z_-122": 462,
    "NUM_Z_-125": 463,
    "NUM_Z_0001": 464,
    "NUM_Z_0036": 465,
    "NUM_X_1503": 466,
    "NUM_X_1597": 467,
    "NUM_X_1941": 468,
    "NUM_Y_1476": 469,
    "NUM_Y_1588": 470,
    "NUM_Y_1594": 471,
    "NUM_Y_1666": 472,
    "NUM_Z_-069": 473,
    "NUM_X_1528": 474,
    "NUM_X_1576": 475,
    "NUM_X_1593": 476,
    "NUM_X_1602": 477,
    "NUM_Y_1541": 478,
    "NUM_Y_1557": 479,
    "NUM_Y_1563": 480,
    "NUM_Z_-054": 481,
    "NUM_Z_-113": 482,
    "NUM_X_1442": 483,
    "NUM_Y_1492": 484,
    "NUM_Y_1501": 485,
    "NUM_Y_1539": 486,
    "NUM_Y_1569": 487,
    "NUM_Z_0051": 488,
    "NUM_Y_1528": 489,
    "NUM_X_1451": 490,
    "NUM_X_1491": 491,
    "NUM_X_1642": 492,
    "NUM_X_1646": 493,
    "NUM_Y_1487": 494,
    "NUM_Y_1506": 495,
    "NUM_Y_1533": 496,
    "NUM_Y_1552": 497,
    "NUM_Y_1687": 498,
    "NUM_Z_-019": 499,
    "NUM_Z_-089": 500,
    "NUM_Z_0016": 501,
    "NUM_X_1509": 502,
    "NUM_Y_1496": 503,
    "NUM_X_-125": 504,
    "NUM_X_1428": 505,
    "NUM_X_1431": 506,
    "NUM_X_1497": 507,
    "NUM_X_1534": 508,
    "NUM_Y_1504": 509,
    "NUM_Y_1509": 510,
    "NUM_Y_1545": 511,
    "NUM_X_1522": 512,
    "NUM_X_1584": 513,
    "NUM_X_3275": 514,
    "NUM_Y_1530": 515,
    "G2": 516,
    "NUM_X_-208": 517,
    "NUM_X_1456": 518,
    "NUM_X_1489": 519,
    "NUM_X_1595": 520,
    "NUM_X_3358": 521,
    "NUM_Y_1483": 522,
    "NUM_Y_1554": 523,
    "NUM_Y_1524": 524,
    "NUM_X_1441": 525,
    "NUM_X_1483": 526,
    "NUM_X_1630": 527,
    "NUM_Y_1482": 528,
    "NUM_Y_1499": 529,
    "NUM_Y_1518": 530,
    "NUM_Y_1536": 531,
    "NUM_Y_1560": 532,
    "NUM_Y_1652": 533,
    "NUM_Y_1684": 534,
    "NUM_Z_-090": 535,
    "NUM_Z_0015": 536,
    "NUM_X_1546": 537,
    "NUM_Y_1475": 538,
    "NUM_Y_1466": 539,
    "NUM_Y_1486": 540,
    "NUM_Y_1578": 541,
    "NUM_Y_1675": 542,
    "NUM_Z_-011": 543,
    "NUM_X_1561": 544,
    "NUM_X_1573": 545,
    "NUM_X_1589": 546,
    "NUM_X_1600": 547,
    "NUM_X_1624": 548,
    "NUM_Y_1549": 549,
    "NUM_Y_1565": 550,
    "NUM_Y_1571": 551,
    "NUM_Y_1649": 552,
    "NUM_Y_1658": 553,
    "NUM_Z_-042": 554,
    "NUM_Z_-055": 555,
    "NUM_Z_-077": 556,
    "NUM_Z_-112": 557,
    "NUM_X_1435": 558,
    "NUM_X_1579": 559,
    "NUM_X_1590": 560,
    "NUM_X_1943": 561,
    "NUM_Y_1564": 562,
    "NUM_Y_1584": 563,
    "NUM_Y_1596": 564,
    "NUM_Y_1611": 565,
    "NUM_X_1504": 566,
    "NUM_X_1547": 567,
    "NUM_X_1555": 568,
    "NUM_X_1567": 569,
    "NUM_X_1568": 570,
    "NUM_X_1578": 571,
    "NUM_X_1594": 572,
    "NUM_X_1599": 573,
    "NUM_X_1607": 574,
    "NUM_X_1628": 575,
    "NUM_Y_1463": 576,
    "NUM_Y_1514": 577,
    "NUM_Y_1590": 578,
    "NUM_Y_1605": 579,
    "NUM_Y_1622": 580,
    "NUM_Y_1628": 581,
    "NUM_Y_1639": 582,
    "NUM_Y_1644": 583,
    "NUM_Y_1653": 584,
    "NUM_Z_-007": 585,
    "NUM_Z_-067": 586,
    "NUM_Z_-079": 587,
    "NUM_Z_-102": 588,
    "NUM_Z_-121": 589,
    "NUM_Z_0037": 590,
    "NUM_X_-143": 591,
    "NUM_X_1421": 592,
    "NUM_X_1450": 593,
    "NUM_X_1454": 594,
    "NUM_X_1455": 595,
    "NUM_X_1460": 596,
    "NUM_X_1465": 597,
    "NUM_X_1486": 598,
    "NUM_X_1492": 599,
    "NUM_X_1493": 600,
    "NUM_X_1498": 601,
    "NUM_X_1510": 602,
    "NUM_X_1525": 603,
    "NUM_X_1531": 604,
    "NUM_X_1543": 605,
    "NUM_X_1544": 606,
    "NUM_X_1545": 607,
    "NUM_X_1571": 608,
    "NUM_X_1633": 609,
    "NUM_X_3287": 610,
    "NUM_X_3291": 611,
    "NUM_X_3307": 612,
    "NUM_X_3312": 613,
    "NUM_Y_0043": 614,
    "NUM_Y_0126": 615,
    "NUM_Y_0209": 616,
    "NUM_Y_0292": 617,
    "NUM_Y_0375": 618,
    "NUM_Y_0458": 619,
    "NUM_Y_0540": 620,
    "NUM_Y_0624": 621,
    "NUM_Y_0706": 622,
    "NUM_Y_0789": 623,
    "NUM_Y_0872": 624,
    "NUM_Y_0955": 625,
    "NUM_Y_1038": 626,
    "NUM_Y_1121": 627,
    "NUM_Y_1204": 628,
    "NUM_Y_1287": 629,
    "NUM_Y_1370": 630,
    "NUM_Y_1453": 631,
    "NUM_Y_1497": 632,
    "NUM_Y_1508": 633,
    "NUM_Y_1515": 634,
    "NUM_Y_1519": 635,
    "NUM_Y_1520": 636,
    "NUM_Y_1525": 637,
    "NUM_Y_1587": 638,
    "NUM_Y_1599": 639,
    "NUM_Y_1615": 640,
    "NUM_Y_1619": 641,
    "NUM_Y_1623": 642,
    "NUM_Y_1654": 643,
    "NUM_Y_1662": 644,
    "NUM_Y_1702": 645,
    "NUM_Y_1785": 646,
    "NUM_Y_1868": 647,
    "NUM_Y_1951": 648,
    "NUM_Y_2034": 649,
    "NUM_Y_2117": 650,
    "NUM_Y_2200": 651,
    "NUM_Y_2283": 652,
    "NUM_Y_2366": 653,
    "NUM_Y_2449": 654,
    "NUM_Y_2532": 655,
    "NUM_Y_2615": 656,
    "NUM_Y_2698": 657,
    "NUM_Y_2781": 658,
    "NUM_Y_2864": 659,
    "NUM_Y_2946": 660,
    "NUM_Y_3030": 661,
    "NUM_Z_-021": 662,
    "NUM_Z_-032": 663,
    "NUM_Z_-044": 664,
    "NUM_Z_-065": 665,
    "NUM_Z_0073": 666,
    "NUM_Z_0094": 667
  }
}