{
  "PAD": 0,
  "BOS": 1,
  "EOS": 2,
  "UNK": 3,
  "MASK": 4,
  "X": 5,
  "Y": 6,
  "Z": 7,
  "R": 8,
  "NUM_Y_1575": 9,
  "NUM_X_1650": 10,
  "NUM_X_1575": 11,
  "NUM_X_1412": 12,
  "NUM_Y_1693": 13,
  "NUM_Y_1457": 14,
  "NUM_X_1413": 15,
  "G0": 16,
  "NUM_X_1645": 17,
  "NUM_R_3750": 18,
  "NUM_Y_1456": 19,
  "NUM_Y_1458": 20,
  "NUM_Y_1462": 21,
  "NUM_X_1414": 22,
  "NUM_Y_1694": 23,
  "NUM_X_1647": 24,
  "NUM_X_1649": 25,
  "NUM_Y_1690": 26,
  "NUM_X_1444": 27,
  "NUM_Y_1460": 28,
  "NUM_X_1453": 29,
  "NUM_X_1648": 30,
  "NUM_X_1416": 31,
  "NUM_Y_1692": 32,
  "NUM_X_1417": 33,
  "NUM_X_1500": 34,
  "NUM_X_1592": 35,
  "NUM_X_1586": 36,
  "NUM_X_1631": 37,
  "NUM_Y_1470": 38,
  "NUM_X_1634": 39,
  "NUM_X_1581": 40,
  "NUM_X_1463": 41,
  "NUM_X_1641": 42,
  "NUM_X_1436": 43,
  "NUM_X_1458": 44,
  "NUM_Y_1490": 45,
  "NUM_Y_1688": 46,
  "NUM_X_1440": 47,
  "NUM_X_1643": 48,
  "NUM_Y_1678": 49,
  "NUM_X_1422": 50,
  "NUM_Y_1464": 51,
  "NUM_X_1419": 52,
  "NUM_X_1424": 53,
  "NUM_X_1619": 54,
  "NUM_X_1627": 55,
  "NUM_Y_1459": 56,
  "NUM_Y_1517": 57,
  "NUM_Z_600": 58,
  "NUM_X_1415": 59,
  "NUM_X_1548": 60,
  "NUM_X_1623": 61,
  "NUM_Y_1664": 62,
  "NUM_R_1500": 63,
  "NUM_R_2250": 64,
  "NUM_R_3000": 65,
  "NUM_R_750": 66,
  "NUM_X_1469": 67,
  "NUM_X_1471": 68,
  "NUM_X_1477": 69,
  "NUM_X_1482": 70,
  "NUM_X_1529": 71,
  "NUM_X_1554": 72,
  "NUM_X_1560": 73,
  "NUM_X_1615": 74,
  "NUM_X_1950": 75,
  "NUM_Y_1650": 76,
  "NUM_Y_1676": 77,
  "NUM_Y_1683": 78,
  "NUM_X_1427": 79,
  "NUM_X_1430": 80,
  "NUM_X_1449": 81,
  "NUM_X_1488": 82,
  "NUM_X_1494": 83,
  "NUM_X_1535": 84,
  "NUM_X_1563": 85,
  "NUM_Y_1608": 86,
  "NUM_Y_1656": 87,
  "NUM_Y_1661": 88,
  "NUM_X_1598": 89,
  "NUM_X_1603": 90,
  "NUM_Y_1465": 91,
  "NUM_Y_1602": 92,
  "NUM_Y_1614": 93,
  "NUM_Y_1620": 94,
  "NUM_Y_1646": 95,
  "NUM_Y_1651": 96,
  "NUM_Z_-8": 97,
  "NUM_Z_-66": 98,
  "NUM_R_830": 99,
  "NUM_X_1569": 100,
  "NUM_X_1608": 101,
  "NUM_Y_1467": 102,
  "NUM_Y_1473": 103,
  "NUM_Y_1480": 104,
  "NUM_Y_1677": 105,
  "NUM_Y_1685": 106,
  "NUM_Z_-115": 107,
  "NUM_Z_-43": 108,
  "NUM_X_1587": 109,
  "NUM_Y_1680": 110,
  "NUM_Z_-10": 111,
  "NUM_Z_-78": 112,
  "NUM_X_1438": 113,
  "NUM_X_1640": 114,
  "NUM_Y_1516": 115,
  "NUM_X_1434": 116,
  "NUM_X_1516": 117,
  "NUM_Y_1478": 118,
  "NUM_X_1432": 119,
  "NUM_X_1513": 120,
  "NUM_Y_1689": 121,
  "NUM_Z_99": 122,
  "G3": 123,
  "NUM_X_1501": 124,
  "NUM_X_1526": 125,
  "NUM_X_1637": 126,
  "NUM_Y_1522": 127,
  "NUM_Y_1686": 128,
  "NUM_X_1448": 129,
  "NUM_X_1507": 130,
  "NUM_Y_1510": 131,
  "NUM_Y_1542": 132,
  "NUM_Y_1691": 133,
  "NUM_Z_-20": 134,
  "NUM_Z_89": 135,
  "NUM_Y_1672": 136,
  "NUM_X_1520": 137,
  "NUM_X_1638": 138,
  "NUM_Y_1494": 139,
  "NUM_Y_1548": 140,
  "NUM_Z_50": 141,
  "NUM_Y_1469": 142,
  "NUM_Y_1511": 143,
  "NUM_Y_1660": 144,
  "NUM_Z_80": 145,
  "NUM_Z_90": 146,
  "G1": 147,
  "NUM_X_1495": 148,
  "NUM_Y_1472": 149,
  "NUM_Y_1603": 150,
  "NUM_Y_1645": 151,
  "NUM_Z_-117": 152,
  "NUM_Z_-68": 153,
  "NUM_Z_81": 154,
  "NUM_Z_88": 155,
  "NUM_Z_96": 156,
  "NUM_X_1541": 157,
  "NUM_X_1542": 158,
  "NUM_X_1605": 159,
  "NUM_X_1610": 160,
  "NUM_X_1614": 161,
  "NUM_Y_1484": 162,
  "NUM_Y_1591": 163,
  "NUM_Y_1616": 164,
  "NUM_Y_1655": 165,
  "NUM_Y_1668": 166,
  "NUM_Y_1681": 167,
  "NUM_Z_-76": 168,
  "NUM_Z_2": 169,
  "NUM_Z_78": 170,
  "NUM_Z_79": 171,
  "NUM_Z_98": 172,
  "Z0.": 173,
  "F": 174,
  "G53": 175,
  "M30": 176,
  "NUM_F_7": 177,
  "NUM_X_1425": 178,
  "NUM_X_1480": 179,
  "NUM_X_1538": 180,
  "NUM_Y_1461": 181,
  "NUM_Y_1468": 182,
  "NUM_Y_1500": 183,
  "NUM_Y_1529": 184,
  "NUM_Y_1535": 185,
  "NUM_Y_1589": 186,
  "NUM_Y_1600": 187,
  "NUM_Y_1633": 188,
  "NUM_Y_1634": 189,
  "NUM_Y_1674": 190,
  "NUM_Z_-100": 191,
  "NUM_Z_-114": 192,
  "NUM_Z_-56": 193,
  "NUM_Z_-88": 194,
  "NUM_Z_0": 195,
  "NUM_Z_10": 196,
  "NUM_Z_100": 197,
  "NUM_Z_14": 198,
  "NUM_Z_200": 199,
  "NUM_Z_25": 200,
  "NUM_Z_7": 201,
  "NUM_Z_76": 202,
  "NUM_Z_77": 203,
  "NUM_Z_86": 204,
  "NUM_Z_97": 205,
  "F22.": 206,
  "NUM_X_1200": 207,
  "NUM_X_1350": 208,
  "NUM_X_1420": 209,
  "NUM_X_1429": 210,
  "NUM_X_1466": 211,
  "NUM_X_1468": 212,
  "NUM_X_1472": 213,
  "NUM_X_1474": 214,
  "NUM_X_1566": 215,
  "NUM_X_1572": 216,
  "NUM_X_1612": 217,
  "NUM_X_1613": 218,
  "NUM_X_1629": 219,
  "NUM_X_1635": 220,
  "NUM_X_1800": 221,
  "NUM_Y_1200": 222,
  "NUM_Y_1275": 223,
  "NUM_Y_1425": 224,
  "NUM_Y_1471": 225,
  "NUM_Y_1474": 226,
  "NUM_Y_1477": 227,
  "NUM_Y_1481": 228,
  "NUM_Y_1485": 229,
  "NUM_Y_1489": 230,
  "NUM_Y_1491": 231,
  "NUM_Y_1495": 232,
  "NUM_Y_1505": 233,
  "NUM_Y_1523": 234,
  "NUM_Y_1540": 235,
  "NUM_Y_1547": 236,
  "NUM_Y_1550": 237,
  "NUM_Y_1555": 238,
  "NUM_Y_1556": 239,
  "NUM_Y_1561": 240,
  "NUM_Y_1562": 241,
  "NUM_Y_1567": 242,
  "NUM_Y_1568": 243,
  "NUM_Y_1573": 244,
  "NUM_Y_1576": 245,
  "NUM_Y_1580": 246,
  "NUM_Y_1581": 247,
  "NUM_Y_1583": 248,
  "NUM_Y_1595": 249,
  "NUM_Y_1597": 250,
  "NUM_Y_1606": 251,
  "NUM_Y_1610": 252,
  "NUM_Y_1621": 253,
  "NUM_Y_1627": 254,
  "NUM_Y_1638": 255,
  "NUM_Y_1640": 256,
  "NUM_Y_1659": 257,
  "NUM_Y_1665": 258,
  "NUM_Y_1682": 259,
  "NUM_Y_1800": 260,
  "NUM_Y_1950": 261,
  "NUM_Z_-1": 262,
  "NUM_Z_-103": 263,
  "NUM_Z_-104": 264,
  "NUM_Z_-105": 265,
  "NUM_Z_-106": 266,
  "NUM_Z_-107": 267,
  "NUM_Z_-108": 268,
  "NUM_Z_-109": 269,
  "NUM_Z_-110": 270,
  "NUM_Z_-111": 271,
  "NUM_Z_-116": 272,
  "NUM_Z_-118": 273,
  "NUM_Z_-119": 274,
  "NUM_Z_-12": 275,
  "NUM_Z_-120": 276,
  "NUM_Z_-123": 277,
  "NUM_Z_-124": 278,
  "NUM_Z_-13": 279,
  "NUM_Z_-14": 280,
  "NUM_Z_-15": 281,
  "NUM_Z_-16": 282,
  "NUM_Z_-17": 283,
  "NUM_Z_-18": 284,
  "NUM_Z_-2": 285,
  "NUM_Z_-23": 286,
  "NUM_Z_-24": 287,
  "NUM_Z_-25": 288,
  "NUM_Z_-26": 289,
  "NUM_Z_-27": 290,
  "NUM_Z_-28": 291,
  "NUM_Z_-29": 292,
  "NUM_Z_-3": 293,
  "NUM_Z_-30": 294,
  "NUM_Z_-33": 295,
  "NUM_Z_-34": 296,
  "NUM_Z_-35": 297,
  "NUM_Z_-36": 298,
  "NUM_Z_-37": 299,
  "NUM_Z_-38": 300,
  "NUM_Z_-39": 301,
  "NUM_Z_-4": 302,
  "NUM_Z_-40": 303,
  "NUM_Z_-41": 304,
  "NUM_Z_-46": 305,
  "NUM_Z_-47": 306,
  "NUM_Z_-48": 307,
  "NUM_Z_-49": 308,
  "NUM_Z_-5": 309,
  "NUM_Z_-50": 310,
  "NUM_Z_-51": 311,
  "NUM_Z_-52": 312,
  "NUM_Z_-53": 313,
  "NUM_Z_-58": 314,
  "NUM_Z_-59": 315,
  "NUM_Z_-6": 316,
  "NUM_Z_-60": 317,
  "NUM_Z_-61": 318,
  "NUM_Z_-62": 319,
  "NUM_Z_-63": 320,
  "NUM_Z_-64": 321,
  "NUM_Z_-70": 322,
  "NUM_Z_-71": 323,
  "NUM_Z_-72": 324,
  "NUM_Z_-73": 325,
  "NUM_Z_-74": 326,
  "NUM_Z_-81": 327,
  "NUM_Z_-82": 328,
  "NUM_Z_-83": 329,
  "NUM_Z_-84": 330,
  "NUM_Z_-85": 331,
  "NUM_Z_-86": 332,
  "NUM_Z_-91": 333,
  "NUM_Z_-92": 334,
  "NUM_Z_-93": 335,
  "NUM_Z_-94": 336,
  "NUM_Z_-95": 337,
  "NUM_Z_-96": 338,
  "NUM_Z_-97": 339,
  "NUM_Z_-98": 340,
  "NUM_Z_11": 341,
  "NUM_Z_111": 342,
  "NUM_Z_12": 343,
  "NUM_Z_125": 344,
  "NUM_Z_17": 345,
  "NUM_Z_18": 346,
  "NUM_Z_19": 347,
  "NUM_Z_20": 348,
  "NUM_Z_21": 349,
  "NUM_Z_22": 350,
  "NUM_Z_23": 351,
  "NUM_Z_24": 352,
  "NUM_Z_27": 353,
  "NUM_Z_28": 354,
  "NUM_Z_29": 355,
  "NUM_Z_30": 356,
  "NUM_Z_31": 357,
  "NUM_Z_32": 358,
  "NUM_Z_33": 359,
  "NUM_Z_34": 360,
  "NUM_Z_35": 361,
  "NUM_Z_38": 362,
  "NUM_Z_39": 363,
  "NUM_Z_4": 364,
  "NUM_Z_40": 365,
  "NUM_Z_41": 366,
  "NUM_Z_42": 367,
  "NUM_Z_43": 368,
  "NUM_Z_44": 369,
  "NUM_Z_45": 370,
  "NUM_Z_46": 371,
  "NUM_Z_47": 372,
  "NUM_Z_48": 373,
  "NUM_Z_5": 374,
  "NUM_Z_52": 375,
  "NUM_Z_53": 376,
  "NUM_Z_54": 377,
  "NUM_Z_55": 378,
  "NUM_Z_56": 379,
  "NUM_Z_57": 380,
  "NUM_Z_58": 381,
  "NUM_Z_59": 382,
  "NUM_Z_6": 383,
  "NUM_Z_60": 384,
  "NUM_Z_62": 385,
  "NUM_Z_63": 386,
  "NUM_Z_64": 387,
  "NUM_Z_65": 388,
  "NUM_Z_66": 389,
  "NUM_Z_67": 390,
  "NUM_Z_68": 391,
  "NUM_Z_69": 392,
  "NUM_Z_70": 393,
  "NUM_Z_71": 394,
  "NUM_Z_72": 395,
  "NUM_Z_74": 396,
  "NUM_Z_75": 397,
  "NUM_Z_8": 398,
  "NUM_Z_82": 399,
  "NUM_Z_83": 400,
  "NUM_Z_85": 401,
  "NUM_Z_87": 402,
  "NUM_Z_9": 403,
  "NUM_Z_91": 404,
  "NUM_Z_92": 405,
  "NUM_Z_93": 406,
  "NUM_X_1418": 407,
  "NUM_X_1423": 408,
  "NUM_X_1426": 409,
  "NUM_X_1446": 410,
  "NUM_X_1461": 411,
  "NUM_X_1485": 412,
  "NUM_X_1506": 413,
  "NUM_X_1519": 414,
  "NUM_X_1523": 415,
  "NUM_X_1553": 416,
  "NUM_X_1557": 417,
  "NUM_X_1617": 418,
  "NUM_X_1621": 419,
  "NUM_X_1636": 420,
  "NUM_Y_1493": 421,
  "NUM_Y_1502": 422,
  "NUM_Y_1507": 423,
  "NUM_Y_1512": 424,
  "NUM_Y_1521": 425,
  "NUM_Y_1527": 426,
  "NUM_Y_1538": 427,
  "NUM_Y_1544": 428,
  "NUM_Y_1586": 429,
  "NUM_Y_1626": 430,
  "NUM_Y_1641": 431,
  "NUM_Y_1642": 432,
  "NUM_Y_1669": 433,
  "NUM_Y_1670": 434,
  "NUM_Y_1671": 435,
  "NUM_Z_-22": 436,
  "NUM_Z_-31": 437,
  "NUM_Z_-45": 438,
  "NUM_Z_-57": 439,
  "NUM_Z_-80": 440,
  "NUM_Z_-87": 441,
  "NUM_Z_-99": 442,
  "NUM_Z_13": 443,
  "NUM_Z_95": 444,
  "NUM_X_1512": 445,
  "NUM_X_1532": 446,
  "NUM_X_1551": 447,
  "NUM_X_1632": 448,
  "NUM_X_1644": 449,
  "NUM_Y_1498": 450,
  "NUM_Y_1532": 451,
  "NUM_Y_1582": 452,
  "NUM_Y_1593": 453,
  "NUM_Y_1624": 454,
  "NUM_Y_1630": 455,
  "NUM_Y_1632": 456,
  "NUM_Y_1635": 457,
  "NUM_Y_1637": 458,
  "NUM_Y_1673": 459,
  "NUM_Z_-101": 460,
  "NUM_Z_-122": 461,
  "NUM_Z_-125": 462,
  "NUM_Z_-75": 463,
  "NUM_Z_1": 464,
  "NUM_Z_36": 465,
  "NUM_X_1503": 466,
  "NUM_X_1597": 467,
  "NUM_X_1941": 468,
  "NUM_Y_1476": 469,
  "NUM_Y_1588": 470,
  "NUM_Y_1594": 471,
  "NUM_Y_1666": 472,
  "NUM_Z_-69": 473,
  "NUM_X_1528": 474,
  "NUM_X_1576": 475,
  "NUM_X_1593": 476,
  "NUM_X_1602": 477,
  "NUM_Y_1541": 478,
  "NUM_Y_1557": 479,
  "NUM_Y_1563": 480,
  "NUM_Z_-113": 481,
  "NUM_Z_-54": 482,
  "NUM_X_1442": 483,
  "NUM_Y_1492": 484,
  "NUM_Y_1501": 485,
  "NUM_Y_1539": 486,
  "NUM_Y_1569": 487,
  "NUM_Z_51": 488,
  "NUM_Y_1528": 489,
  "NUM_X_1451": 490,
  "NUM_X_1491": 491,
  "NUM_X_1642": 492,
  "NUM_X_1646": 493,
  "NUM_Y_1487": 494,
  "NUM_Y_1506": 495,
  "NUM_Y_1533": 496,
  "NUM_Y_1552": 497,
  "NUM_Y_1687": 498,
  "NUM_Z_-19": 499,
  "NUM_Z_-89": 500,
  "NUM_Z_16": 501,
  "NUM_X_1509": 502,
  "NUM_Y_1496": 503,
  "NUM_X_-125": 504,
  "NUM_X_1428": 505,
  "NUM_X_1431": 506,
  "NUM_X_1497": 507,
  "NUM_X_1534": 508,
  "NUM_Y_1504": 509,
  "NUM_Y_1509": 510,
  "NUM_Y_1545": 511,
  "NUM_X_1522": 512,
  "NUM_X_1584": 513,
  "NUM_X_3275": 514,
  "NUM_Y_1530": 515,
  "G2": 516,
  "NUM_X_-208": 517,
  "NUM_X_1456": 518,
  "NUM_X_1489": 519,
  "NUM_X_1595": 520,
  "NUM_X_3358": 521,
  "NUM_Y_1483": 522,
  "NUM_Y_1554": 523,
  "NUM_Y_1524": 524,
  "NUM_X_1441": 525,
  "NUM_X_1483": 526,
  "NUM_X_1630": 527,
  "NUM_Y_1482": 528,
  "NUM_Y_1499": 529,
  "NUM_Y_1518": 530,
  "NUM_Y_1536": 531,
  "NUM_Y_1560": 532,
  "NUM_Y_1652": 533,
  "NUM_Y_1684": 534,
  "NUM_Z_-90": 535,
  "NUM_Z_15": 536,
  "NUM_X_1546": 537,
  "NUM_Y_1475": 538,
  "NUM_Y_1466": 539,
  "NUM_Y_1486": 540,
  "NUM_Y_1578": 541,
  "NUM_Y_1675": 542,
  "NUM_Z_-11": 543,
  "NUM_X_1561": 544,
  "NUM_X_1573": 545,
  "NUM_X_1589": 546,
  "NUM_X_1600": 547,
  "NUM_X_1624": 548,
  "NUM_Y_1549": 549,
  "NUM_Y_1565": 550,
  "NUM_Y_1571": 551,
  "NUM_Y_1649": 552,
  "NUM_Y_1658": 553,
  "NUM_Z_-112": 554,
  "NUM_Z_-42": 555,
  "NUM_Z_-55": 556,
  "NUM_Z_-77": 557,
  "NUM_X_1435": 558,
  "NUM_X_1579": 559,
  "NUM_X_1590": 560,
  "NUM_X_1943": 561,
  "NUM_Y_1564": 562,
  "NUM_Y_1584": 563,
  "NUM_Y_1596": 564,
  "NUM_Y_1611": 565,
  "NUM_X_1504": 566,
  "NUM_X_1547": 567,
  "NUM_X_1555": 568,
  "NUM_X_1567": 569,
  "NUM_X_1568": 570,
  "NUM_X_1578": 571,
  "NUM_X_1594": 572,
  "NUM_X_1599": 573,
  "NUM_X_1607": 574,
  "NUM_X_1628": 575,
  "NUM_Y_1463": 576,
  "NUM_Y_1514": 577,
  "NUM_Y_1590": 578,
  "NUM_Y_1605": 579,
  "NUM_Y_1622": 580,
  "NUM_Y_1628": 581,
  "NUM_Y_1639": 582,
  "NUM_Y_1644": 583,
  "NUM_Y_1653": 584,
  "NUM_Z_-102": 585,
  "NUM_Z_-121": 586,
  "NUM_Z_-67": 587,
  "NUM_Z_-7": 588,
  "NUM_Z_-79": 589,
  "NUM_Z_37": 590,
  "NUM_X_-143": 591,
  "NUM_X_1421": 592,
  "NUM_X_1450": 593,
  "NUM_X_1454": 594,
  "NUM_X_1455": 595,
  "NUM_X_1460": 596,
  "NUM_X_1465": 597,
  "NUM_X_1486": 598,
  "NUM_X_1492": 599,
  "NUM_X_1493": 600,
  "NUM_X_1498": 601,
  "NUM_X_1510": 602,
  "NUM_X_1525": 603,
  "NUM_X_1531": 604,
  "NUM_X_1543": 605,
  "NUM_X_1544": 606,
  "NUM_X_1545": 607,
  "NUM_X_1571": 608,
  "NUM_X_1633": 609,
  "NUM_X_3287": 610,
  "NUM_X_3291": 611,
  "NUM_X_3307": 612,
  "NUM_X_3312": 613,
  "NUM_Y_1038": 614,
  "NUM_Y_1121": 615,
  "NUM_Y_1204": 616,
  "NUM_Y_126": 617,
  "NUM_Y_1287": 618,
  "NUM_Y_1370": 619,
  "NUM_Y_1453": 620,
  "NUM_Y_1497": 621,
  "NUM_Y_1508": 622,
  "NUM_Y_1515": 623,
  "NUM_Y_1519": 624,
  "NUM_Y_1520": 625,
  "NUM_Y_1525": 626,
  "NUM_Y_1587": 627,
  "NUM_Y_1599": 628,
  "NUM_Y_1615": 629,
  "NUM_Y_1619": 630,
  "NUM_Y_1623": 631,
  "NUM_Y_1654": 632,
  "NUM_Y_1662": 633,
  "NUM_Y_1702": 634,
  "NUM_Y_1785": 635,
  "NUM_Y_1868": 636,
  "NUM_Y_1951": 637,
  "NUM_Y_2034": 638,
  "NUM_Y_209": 639,
  "NUM_Y_2117": 640,
  "NUM_Y_2200": 641,
  "NUM_Y_2283": 642,
  "NUM_Y_2366": 643,
  "NUM_Y_2449": 644,
  "NUM_Y_2532": 645,
  "NUM_Y_2615": 646,
  "NUM_Y_2698": 647,
  "NUM_Y_2781": 648,
  "NUM_Y_2864": 649,
  "NUM_Y_292": 650,
  "NUM_Y_2946": 651,
  "NUM_Y_3030": 652,
  "NUM_Y_375": 653,
  "NUM_Y_43": 654,
  "NUM_Y_458": 655,
  "NUM_Y_540": 656,
  "NUM_Y_624": 657,
  "NUM_Y_706": 658,
  "NUM_Y_789": 659,
  "NUM_Y_872": 660,
  "NUM_Y_955": 661,
  "NUM_Z_-21": 662,
  "NUM_Z_-32": 663,
  "NUM_Z_-44": 664,
  "NUM_Z_-65": 665,
  "NUM_Z_73": 666,
  "NUM_Z_94": 667
}